### Create a list , tuple and a set with elements 1-10. Convert each of the data types into a Pandas Series. Also a create a seperate list of indexes for the Series

In [1]:
import pandas as pd

my_list = list(range(1, 11))
my_tuple = tuple(range(1, 11))
my_set = set(range(1, 11))  

index_list = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

list_series = pd.Series(my_list, index=index_list)
tuple_series = pd.Series(my_tuple, index=index_list)
set_series = pd.Series(sorted(my_set), index=index_list) 

print("Series from List:\n", list_series, "\n")
print("Series from Tuple:\n", tuple_series, "\n")
print("Series from Set:\n", set_series)

Series from List:
 a     1
b     2
c     3
d     4
e     5
f     6
g     7
h     8
i     9
j    10
dtype: int64

Series from Tuple:
 a     1
b     2
c     3
d     4
e     5
f     6
g     7
h     8
i     9
j    10
dtype: int64

Series from Set:
 a     1
b     2
c     3
d     4
e     5
f     6
g     7
h     8
i     9
j    10
dtype: int64

### 2nd way to do this same question

In [4]:
import pandas as pd

# Data
my_list = [1,2,3,4,5,6,7,8,9,10]
my_tuple = (1,2,3,4,5,6,7,8,9,10)
my_set = {1,2,3,4,5,6,7,8,9,10}

# Indexes
indexes = ['a','b','c','d','e','f','g','h','i','j']

# Convert to Series
list_series = pd.Series(my_list, index=indexes)
tuple_series = pd.Series(my_tuple, index=indexes)
set_series = pd.Series(sorted(my_set), index=indexes)  # sort to keep order

# Print the results
print("List Series:\n", list_series, "\n")
print("Tuple Series:\n", tuple_series, "\n")
print("Set Series:\n", set_series)

List Series:
 a     1
b     2
c     3
d     4
e     5
f     6
g     7
h     8
i     9
j    10
dtype: int64

Tuple Series:
 a     1
b     2
c     3
d     4
e     5
f     6
g     7
h     8
i     9
j    10
dtype: int64

Set Series:
 a     1
b     2
c     3
d     4
e     5
f     6
g     7
h     8
i     9
j    10
dtype: int64

### Create a dictionary with 5 key value pairs. Convert the dictionary into a Series.

In [23]:
data = {
    'a': 10,
    'b': 20,
    'c': 30,
    'd': 40,
    'e': 50
}

data_series = pd.Series(data)

print("Series from Dictionary:\n", data_series)

Series from Dictionary:
 a    10
b    20
c    30
d    40
e    50
dtype: int64

### Create a Series store 10 elements convert this series into a list , set , tuple and a dictionary.

In [28]:
# Create a Series with 10 elements
my_series = pd.Series([11, 22, 33, 44, 55, 66, 77, 88, 99, 100])

# Convert Series into different data types
as_list = my_series.tolist()
as_set = set(my_series)
as_tuple = tuple(my_series)
as_dict = my_series.to_dict()

# Print the results
print("Original Series:\n", my_series, "\n")
print("As List:\n", as_list, "\n")
print("As Set:\n", as_set, "\n")
print("As Tuple:\n", as_tuple, "\n")
print("As Dictionary:\n", as_dict)

Original Series:
 0     11
1     22
2     33
3     44
4     55
5     66
6     77
7     88
8     99
9    100
dtype: int64

As List:
 [11, 22, 33, 44, 55, 66, 77, 88, 99, 100]

As Set:
 {33, 66, 99, 100, 11, 44, 77, 22, 55, 88}

As Tuple:
 (11, 22, 33, 44, 55, 66, 77, 88, 99, 100)

As Dictionary:
 {0: 11, 1: 22, 2: 33, 3: 44, 4: 55, 5: 66, 6: 77, 7: 88, 8: 99, 9: 100}

### Create a sample series with 10 numerical elements. Print the first 5 and last 5 rows of the Series. Update the 5th index with the value 200. Update the last element of your series with the value 120. Delete the first element from the Series.

In [37]:
# Step 1: Create a Series with 10 elements
my_series = pd.Series([10, 20, 30, 40, 50, 60, 70, 80, 90, 100])

# Step 2: Print the first 5 and last 5 elements
print("First 5 elements:\n", my_series.head(), "\n")
print("Last 5 elements:\n", my_series.tail(), "\n")

# Step 3: Update the value at index 5 (6th position) to 200
my_series[5] = 200

# Step 4: Update the last element to 120
my_series[my_series.index[-1]] = 120

# Step 5: Delete the first element (index 0)
my_series = my_series.drop(0)

# Final Series
print("Updated Series:\n", my_series)

First 5 elements:
 0    10
1    20
2    30
3    40
4    50
dtype: int64

Last 5 elements:
 5     60
6     70
7     80
8     90
9    100
dtype: int64

Updated Series:
 1     20
2     30
3     40
4     50
5    200
6     70
7     80
8     90
9    120
dtype: int64

### 2nd method

In [48]:
# Run each code in a particular cell
sample = pd.Series([10,20,30,40,50,60,70,80,90,100])
sample

# Display the first 5 rows
sample.head()
sample

# Display the last 5 rows
sample.tail()
sample

sample[5] = 200 #Updating the 5th index element value.
sample

sample[9] = 120 #Updating the 9th index element value.
sample
sample.drop(0,inplace=True)   #inplace=True it will store/update the result in actual Series.

sample

1     20
2     30
3     40
4     50
5    200
6     70
7     80
8     90
9    120
dtype: int64

### Create a nested list and dictionary (in dictionary store the values in a list). Store atleast 5 values in them and then convert them into a dataframe

In [40]:
# Dictionary with lists as values
data_dict = {
    'ID': [101, 102, 103, 104, 105],
    'Product': ['Laptop', 'Phone', 'Tablet', 'Monitor', 'Keyboard'],
    'Price': [1000, 500, 300, 150, 80]
}

# Convert to DataFrame
df_from_dict = pd.DataFrame(data_dict)

print("DataFrame from Dictionary:\n", df_from_dict)

DataFrame from Dictionary:
     ID   Product  Price
0  101    Laptop   1000
1  102     Phone    500
2  103    Tablet    300
3  104   Monitor    150
4  105  Keyboard     80

### Select all the rows where year > 2023 from the above DataFrame

In [51]:
di = {
    'model_name':['Kushaq','Venue','Tucson','Curve','Polo'],
    'Brand':['Skoda','Hyundai','Hyundai','Tata','Wolksvagon'],
    'Year':[2022,2024,2025,2023,2021],
}
di_df = pd.DataFrame(di)
di_df

  model_name       Brand  Year
0     Kushaq       Skoda  2022
1      Venue     Hyundai  2024
2     Tucson     Hyundai  2025
3      Curve        Tata  2023
4       Polo  Wolksvagon  2021

In [57]:
di_df[di_df['Year']>2023]

  model_name    Brand  Year
1      Venue  Hyundai  2024
2     Tucson  Hyundai  2025

In [61]:
di_df[(di_df['Brand']=='Hyundai') & (di_df['Year']>2024)]

  model_name    Brand  Year
2     Tucson  Hyundai  2025

In [ ]:
# Homework:
# Create a dataframe with 4 columns => Car Model , Brand , Year , Price
# Make sure to add atleast 10 rows. 
# You need to select all the rows but only with Car Model and Brand column.
# Select the rows from index 1 till 4 index and columns from brand-price.